I have checked on the v1.1.2 of provider and received different error "Root resource was present, but now absent." (see below):

1) Provider version
```
css@ubuntu-backup:~/devops/terraform/demo3$ terraform version
Terraform v1.4.6
on linux_amd64
+ provider registry.terraform.io/cisco-en-programmability/dnacenter v1.1.2-beta
css@ubuntu-backup:~/devops/terraform/demo3$
```

2) Terraform apply
```
css@ubuntu-backup:~/devops/terraform/demo3$ terraform apply
dnacenter_site.area_a: Refreshing state... [id=name:=Global/Amsterdam/Area B\site_id:=7dc9b5a5-e66b-4d6a-b542-404325b756e0]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # dnacenter_discovery.example will be created
  + resource "dnacenter_discovery" "example" {
      + id           = (known after apply)
      + item         = (known after apply)
      + last_updated = (known after apply)

      + parameters {
          + attribute_info            = (known after apply)
          + cdp_level                 = (known after apply)
          + device_ids                = (known after apply)
          + discovery_condition       = (known after apply)
          + discovery_status          = (known after apply)
          + discovery_type            = "SINGLE"
          + enable_password_list      = (known after apply)
          + global_credential_id_list = (known after apply)
          + ip_address_list           = "192.168.199.223"
          + ip_filter_list            = (known after apply)
          + is_auto_cdp               = (known after apply)
          + lldp_level                = (known after apply)
          + netconf_port              = (known after apply)
          + num_devices               = (known after apply)
          + parent_discovery_id       = (known after apply)
          + password_list             = (sensitive value)
          + preferred_mgmt_ipmethod   = (known after apply)
          + protocol_order            = "ssh"
          + retry                     = (known after apply)
          + retry_count               = 3
          + snmp_auth_passphrase      = (known after apply)
          + snmp_auth_protocol        = (known after apply)
          + snmp_mode                 = (known after apply)
          + snmp_priv_passphrase      = (known after apply)
          + snmp_priv_protocol        = (known after apply)
          + snmp_ro_community         = "<removed>"
          + snmp_ro_community_desc    = (known after apply)
          + snmp_rw_community         = "<removed>"
          + snmp_rw_community_desc    = (known after apply)
          + snmp_user_name            = (known after apply)
          + snmp_version              = (known after apply)
          + time_out                  = (known after apply)
          + timeout                   = 5
          + update_mgmt_ip            = "false"
          + user_name_list            = [
              + "css",
            ]
        }
    }

  # dnacenter_site.area_a will be updated in-place
  ~ resource "dnacenter_site" "area_a" {
        id   = "name:=Global/Amsterdam/Area B\\site_id:=7dc9b5a5-e66b-4d6a-b542-404325b756e0"
      + item = (known after apply)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + dnacenter_discovery_example = (sensitive value)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

dnacenter_discovery.example: Creating...
dnacenter_site.area_a: Modifying... [id=name:=Global/Amsterdam/Area B\site_id:=7dc9b5a5-e66b-4d6a-b542-404325b756e0]
dnacenter_site.area_a: Modifications complete after 0s [id=name:=Global/Amsterdam/Area B\site_id:=7dc9b5a5-e66b-4d6a-b542-404325b756e0]
╷
│ Error: Provider produced inconsistent result after apply
│ 

│ When applying changes to dnacenter_discovery.example, provider "provider[\"registry.terraform.io/cisco-en-programmability/dnacenter\"]" produced an unexpected new value: Root resource was present, but
│ now absent.
│ 
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
css@ubuntu-backup:~/devops/terraform/demo3$ 
```

[project.zip](https://github.com/cisco-en-programmability/terraform-provider-dnacenter/files/11420228/project.zip)
[tf-log.log.txt](https://github.com/cisco-en-programmability/terraform-provider-dnacenter/files/11420229/tf-log.log.txt)
